-- Q1. 各カテゴリの中で、価格が最大である商品を取得する
-- Q2. 各カテゴリの中で、価格が最大ではない商品を取得する
-- Q3. 購入されたことがある商品の中で、在庫数が 20 個未満の商品を取得する
-- Q4. すべての商品が 20000 円以下であるカテゴリを取得する
-- Q5. すべてのオフィス用品よりも高額な商品を取得する
-- Q6. 在庫数が同じ商品を取得するクエリを二通り書いて実行時間を比較する
-- Q7. カテゴリの中で在庫数が最大の商品のリストを取得するクエリを二通り書いて実行時間を比較する

-- 商品在庫テーブルの作成
CREATE TABLE inventory (
    product TEXT PRIMARY KEY, -- 商品名
    stock INTEGER NOT NULL, -- 在庫数
    price INTEGER NOT NULL, -- 価格
    category TEXT NOT NULL -- カテゴリ
);

-- データ挿入
INSERT INTO inventory (product, stock, price, category)
VALUES
    ('ノート', 5, 350, '文房具'),
    ('ペン', 20, 120, '文房具'),
    ('消しゴム', 10, 80, '文房具'),
    ('マーカー', 5, 150, '文房具'),
    ('ホッチキス', 3, 400, 'オフィス用品'),
    ('プリンター', 5, 12000, 'オフィス用品'),
    ('ノートパソコン', 3, 80000, '電子機器'),
    ('スマートフォン', 5, 35000, '電子機器'),
    ('ヘッドフォン', 20, 5000, '電子機器'),
    ('デスク', 5, 80000, '家具');

-- 注文履歴テーブルの作成
CREATE TABLE orders (
    order_id INTEGER PRIMARY KEY, -- 注文 ID
    product TEXT NOT NULL, -- 商品名
    quantity INTEGER NOT NULL, -- 注文数
    order_date TEXT NOT NULL -- 注文日
);

-- 注文履歴データ挿入
INSERT INTO orders (order_id, product, quantity, order_date)
VALUES
    -- 文房具
    (1, 'ノート', 2, '2024-12-01'), -- ノートを 2 冊購入
    (2, 'ペン', 5, '2024-12-01'),
    (3, '消しゴム', 1, '2024-12-02'),
    (4, 'マーカー', 3, '2024-12-03'),
    (5, 'ノート', 4, '2024-12-03'),
    (6, 'ノート', 4, '2024-12-01'),

    -- オフィス用品
    (7, 'ホッチキス', 1, '2024-12-04'),
    (8, 'プリンター', 2, '2024-12-05'),
    (9, 'ホッチキス', 3, '2024-12-02'),
    (10, 'プリンター', 1, '2024-12-03'),
    (11, 'プリンター', 1, '2024-12-04'),
    (12, 'ホッチキス', 2, '2024-12-05'),

    -- 電子機器
    (13, 'ノートパソコン', 1, '2024-12-04'),
    (14, 'ノートパソコン', 1, '2024-12-02'),
    (15, 'スマートフォン', 2, '2024-12-04'),
    (16, 'スマートフォン', 1, '2024-12-01'),
    (17, 'ノートパソコン', 2, '2024-12-02'),

    -- 家具
    (18, 'デスク', 2, '2024-12-02'),
    (19, 'デスク', 1, '2024-12-03'),
    (20, 'デスク', 3, '2024-12-04');

INSERT INTO inventory2 (product, stock, price, category)
VALUES
    ('商品_1', 52, 2933, '家具'),
    ('商品_2', 15, 5442, '文房具'),
    ('商品_3', 8, 2213, 'オフィス用品'),
    ('商品_4', 96, 2211, '電子機器'),
    ('商品_5', 34, 9738, '電子機器'),
    ('商品_6', 89, 4900, '文房具'),
    ('商品_7', 80, 8508, '文房具'),
    ('商品_8', 14, 8995, '家庭用品'),
    ('商品_9', 30, 7155, '電子機器'),
    ('商品_10', 95, 3419, '家具'),
    ('商品_11', 46, 9065, '電子機器'),
    ('商品_12', 6, 7811, 'オフィス用品'),
    ('商品_13', 9, 7067, '家具'),
    ('商品_14', 61, 9206, '家庭用品'),
    ('商品_15', 74, 8589, 'オフィス用品'),
    ('商品_16', 79, 7425, '家具'),
    ('商品_17', 25, 6116, '家庭用品'),
    ('商品_18', 26, 3092, '文房具'),
    ('商品_19', 9, 9799, '文房具'),
    ('商品_20', 77, 6167, '家庭用品'),
    ('商品_21', 38, 1661, 'オフィス用品'),
    ('商品_22', 25, 2060, '家具'),
    ('商品_23', 74, 4626, '電子機器'),
    ('商品_24', 92, 2284, 'オフィス用品'),
    ('商品_25', 46, 1861, '家庭用品'),
    ('商品_26', 60, 1272, '家具'),
    ('商品_27', 53, 7853, '文房具'),
    ('商品_28', 68, 7568, 'オフィス用品'),
    ('商品_29', 94, 7556, '家具'),
    ('商品_30', 78, 2608, '文房具'),
    ('商品_31', 82, 3153, '家庭用品'),
    ('商品_32', 12, 3945, '電子機器'),
    ('商品_33', 40, 1392, 'オフィス用品'),
    ('商品_34', 28, 6343, '家庭用品'),
    ('商品_35', 83, 5318, '文房具'),
    ('商品_36', 30, 2385, '家庭用品'),
    ('商品_37', 43, 5402, '文房具'),
    ('商品_38', 37, 7347, '電子機器'),
    ('商品_39', 66, 6251, '家庭用品'),
    ('商品_40', 93, 4362, 'オフィス用品'),
    ('商品_41', 35, 2113, '文房具'),
    ('商品_42', 89, 7642, '家具'),
    ('商品_43', 65, 3272, '家庭用品'),
    ('商品_44', 72, 1374, '電子機器'),
    ('商品_45', 56, 9963, '家庭用品'),
    ('商品_46', 70, 8136, '電子機器'),
    ('商品_47', 25, 3648, '家具'),
    ('商品_48', 84, 1612, '文房具'),
    ('商品_49', 17, 9989, '家庭用品'),
    ('商品_50', 18, 1264, '文房具'),
    ('商品_51', 71, 8706, '家具'),
    ('商品_52', 48, 3023, '文房具'),
    ('商品_53', 27, 1409, '家庭用品'),
    ('商品_54', 94, 2108, '電子機器'),
    ('商品_55', 11, 1920, '文房具'),
    ('商品_56', 85, 8361, '文房具'),
    ('商品_57', 31, 3937, '電子機器'),
    ('商品_58', 29, 6793, '家具'),
    ('商品_59', 20, 1466, '家庭用品'),
    ('商品_60', 67, 3284, 'オフィス用品'),
    ('商品_61', 21, 4487, '文房具'),
    ('商品_62', 77, 5817, '家具'),
    ('商品_63', 50, 3999, '文房具'),
    ('商品_64', 12, 2985, 'オフィス用品'),
    ('商品_65', 69, 7312, '文房具'),
    ('商品_66', 44, 8667, '家庭用品'),
    ('商品_67', 75, 2931, '文房具'),
    ('商品_68', 38, 3374, '家庭用品'),
    ('商品_69', 57, 3848, 'オフィス用品'),
    ('商品_70', 63, 9928, '電子機器'),
    ('商品_71', 45, 7135, '文房具'),
    ('商品_72', 18, 8605, '家庭用品'),
    ('商品_73', 62, 1399, 'オフィス用品'),
    ('商品_74', 98, 5426, '家庭用品'),
    ('商品_75', 5, 2394, '家具'),
    ('商品_76', 51, 4622, '文房具'),
    ('商品_77', 64, 8473, 'オフィス用品'),
    ('商品_78', 41, 1537, '家具'),
    ('商品_79', 9, 1302, '電子機器'),
    ('商品_80', 14, 8423, '家具'),
    ('商品_81', 88, 5261, '文房具'),
    ('商品_82', 54, 6033, '家庭用品'),
    ('商品_83', 26, 8915, 'オフィス用品'),
    ('商品_84', 76, 4220, '家具'),
    ('商品_85', 60, 8694, '文房具'),
    ('商品_86', 23, 5141, '家庭用品'),
    ('商品_87', 73, 1774, '電子機器'),
    ('商品_88', 86, 8932, '文房具'),
    ('商品_89', 42, 9847, '家具'),
    ('商品_90', 24, 2555, 'オフィス用品'),
    ('商品_91', 32, 3243, '電子機器'),
    ('商品_92', 49, 9787, '家庭用品'),
    ('商品_93', 10, 4293, '文房具'),
    ('商品_94', 7, 5536, '電子機器'),
    ('商品_95', 4, 3058, '文房具'),
    ('商品_96', 19, 7294, '家具'),
    ('商品_97', 28, 8912, '家庭用品'),
    ('商品_98', 91, 3707, 'オフィス用品'),
    ('商品_99', 2, 2497, '家具'),
    ('商品_100', 81, 1893, '文房具');
