-- Q1. カテゴリごとの平均価格よりも高価な商品を取得する
-- Q2. 在庫数が注文数よりも少ない商品を取得する
-- Q3. 最後に注文された商品の在庫数を取得する
-- Q4. 各カテゴリの中で、価格が最大である商品を取得する
-- Q5. 各カテゴリの中で、価格が最大ではない商品を取得する

-- 商品在庫テーブルの作成
CREATE TABLE inventory (
    product TEXT PRIMARY KEY, -- 商品名
    stock INTEGER NOT NULL, -- 在庫数
    price INTEGER NOT NULL, -- 価格
    category TEXT NOT NULL -- カテゴリ
);

-- データ挿入
INSERT INTO inventory (product, stock, price, category)
VALUES
    ('ノート', 5, 350, '文房具'),
    ('ペン', 20, 120, '文房具'),
    ('消しゴム', 10, 80, '文房具'),
    ('マーカー', 5, 150, '文房具'),
    ('ホッチキス', 3, 400, 'オフィス用品'),
    ('プリンター', 5, 12000, 'オフィス用品'),
    ('ノートパソコン', 3, 80000, '電子機器'),
    ('スマートフォン', 5, 35000, '電子機器'),
    ('ヘッドフォン', 20, 5000, '電子機器'),
    ('デスク', 5, 80000, '家具');

-- 注文履歴テーブルの作成
CREATE TABLE orders (
    order_id INTEGER PRIMARY KEY, -- 注文 ID
    product TEXT NOT NULL, -- 商品名
    quantity INTEGER NOT NULL, -- 注文数
    order_datetime TEXT NOT NULL -- 注文日
);

-- 注文履歴データ挿入
INSERT INTO orders (order_id, product, quantity, order_datetime)
VALUES
    -- 文房具
    (1, 'ノート', 2, '2024-12-01 09:30:00'), -- ノートを 2 冊購入
    (2, 'ペン', 5, '2024-12-01 11:45:00'),
    (3, '消しゴム', 1, '2024-12-02 13:15:00'),
    (4, 'マーカー', 3, '2024-12-03 08:50:00'),
    (5, 'ノート', 4, '2024-12-03 15:20:00'),
    (6, 'ノート', 4, '2024-12-01 16:05:00'),

    -- オフィス用品
    (7, 'ホッチキス', 1, '2024-12-04 10:10:00'),
    (8, 'プリンター', 2, '2024-12-05 12:30:00'),
    (9, 'ホッチキス', 3, '2024-12-02 14:25:00'),
    (10, 'プリンター', 1, '2024-12-03 09:40:00'),
    (11, 'プリンター', 1, '2024-12-04 11:50:00'),
    (12, 'ホッチキス', 2, '2024-12-05 16:15:00'),

    -- 電子機器
    (13, 'ノートパソコン', 1, '2024-12-04 14:00:00'),
    (14, 'ノートパソコン', 1, '2024-12-02 10:10:00'),
    (15, 'スマートフォン', 2, '2024-12-04 17:30:00'),
    (16, 'スマートフォン', 1, '2024-12-01 18:00:00'),
    (17, 'ノートパソコン', 2, '2024-12-02 09:20:00'),

    -- 家具
    (18, 'デスク', 2, '2024-12-02 08:30:00'),
    (19, 'デスク', 1, '2024-12-03 10:45:00'),
    (20, 'デスク', 3, '2024-12-04 12:00:00');
