-- Q1. (HML 分析) 価格が 5000 円未満、5000 円以上 20000 円未満、20000 円以上をそれぞれ Low・Middle・High として表示する
-- Q2. HML それぞれに対して商品の平均価格を計算する
-- Q3. Q2 の結果を上から順に L, M, H に並べ替える
-- Q4. HML それぞれに対して一度の注文で購入される商品数の平均を計算する
-- Q5. 休日 (12/1) と平日 (それ以外) に対して、一日の平均売上高を計算する

-- 商品在庫テーブルの作成
CREATE TABLE inventory (
    id INTEGER PRIMARY KEY, -- 商品 ID
    product TEXT NOT NULL, -- 商品名
    stock INTEGER NOT NULL, -- 在庫数
    price INTEGER NOT NULL, -- 価格
    category TEXT NOT NULL -- カテゴリ
);

-- データ挿入
INSERT INTO inventory (id, product, stock, price, category)
VALUES
    (1, 'ノート', 50, 350, '文房具'),
    (2, 'ペン', 200, 120, '文房具'),
    (3, '消しゴム', 10, 80, '文房具'),
    (4, 'マーカー', 5, 150, '文房具'),
    (5, 'ホッチキス', 15, 400, 'オフィス用品'),
    (6, 'プリンター', 10, 12000, 'オフィス用品'),
    (7, 'ノートパソコン', 30, 80000, '電子機器'),
    (8, 'スマートフォン', 100, 35000, '電子機器'),
    (9, 'ヘッドフォン', 20, 5000, '電子機器'),
    (10, 'デスク', 25, 80000, '家具');

-- 注文履歴テーブルの作成
CREATE TABLE orders (
    order_id INTEGER PRIMARY KEY, -- 注文 ID
    product TEXT NOT NULL, -- 商品名
    quantity INTEGER NOT NULL, -- 注文数
    order_date TEXT NOT NULL -- 注文日
);

-- 注文履歴データ挿入
INSERT INTO orders (order_id, product, quantity, order_date)
VALUES
    -- 文房具
    (1, 'ノート', 2, '2024-12-01'), -- ノートを 2 冊購入
    (2, 'ペン', 5, '2024-12-01'),
    (3, '消しゴム', 1, '2024-12-02'),
    (4, 'マーカー', 3, '2024-12-03'),
    (5, 'ノート', 4, '2024-12-03'),
    (6, 'ノート', 4, '2024-12-01'),

    -- オフィス用品
    (7, 'ホッチキス', 1, '2024-12-04'),
    (8, 'プリンター', 2, '2024-12-05'),
    (9, 'ホッチキス', 3, '2024-12-02'),
    (10, 'プリンター', 1, '2024-12-03'),
    (11, 'プリンター', 1, '2024-12-04'),
    (12, 'ホッチキス', 2, '2024-12-05'),

    -- 電子機器
    (13, 'ノートパソコン', 1, '2024-12-04'),
    (14, 'ノートパソコン', 1, '2024-12-02'),
    (15, 'スマートフォン', 2, '2024-12-04'),
    (16, 'スマートフォン', 1, '2024-12-01'),
    (17, 'ノートパソコン', 2, '2024-12-02'),

    -- 家具
    (18, 'デスク', 2, '2024-12-02'),
    (19, 'デスク', 1, '2024-12-03'),
    (20, 'デスク', 3, '2024-12-04');
