-- Q1. 2000 年以降に発売された車種を安い順に 10 個取得する
-- Q2. 最も価格が高い車種を取得し、値段を「最大値」として表示する
-- Q3. 1990 年代に発売された車種の中で、価格が 100 万円以上の車種を取得する
-- Q4. 値段の安い順、名前のアルファベット順に 5 個の車種を取得する
-- Q5. 一つの単語からなる車種名、つまり空白を含まない車種名を取得する

CREATE TABLE Cars
(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL, -- 車種名
    year INTEGER NOT NULL, -- 発売年
    price INTEGER NOT NULL -- 価格
);

INSERT INTO Cars
VALUES
    (1,'350Z',2005,548),
    (2,'911',2005,224),
    (3,'Vanagon',1984,722),
    (4,'Clubman',2010,643),
    (5,'Defender',1992,653),
    (6,'Tracker',2000,560),
    (7,'G6',2005,183),
    (8,'Navigator',2012,63),
    (9,'Savana 1500',2002,793),
    (10,'G35',2006,951),
    (11,'Aerio',2003,112),
    (12,'LX',2000,342),
    (13,'Ranger',1987,700),
    (14,'Legacy',2009,334),
    (15,'TundraMax',2007,128),
    (16,'Express 2500',2012,71),
    (17,'5 Series',1995,668),
    (18,'Bronco II',1987,303),
    (19,'Grand Am',1985,55),
    (20,'Explorer',2001,660),
    (21,'Sebring',2008,198),
    (22,'Malibu',2011,998),
    (23,'DeVille',2004,357),
    (24,'Mountaineer',2000,350),
    (25,'GTI',1998,84),
    (26,'LTD',1985,177),
    (27,'626',1985,758),
    (28,'Mustang',2006,244),
    (29,'Aspen',2009,960),
    (30,'MPV',1989,300),
    (31,'6000',1984,745),
    (32,'Forester',2008,381),
    (33,'Express 2500',2005,234),
    (34,'Rio',2006,962),
    (35,'Rabbit',2007,985),
    (36,'Grand Caravan',2002,600),
    (37,'Jetta III',1994,874),
    (38,'Carrera GT',2004,356),
    (39,'R8',2009,257),
    (40,'Cherokee',1999,945),
    (41,'Silverado 2500',2011,841),
    (42,'LX',2008,668),
    (43,'Sentra',2012,142),
    (44,'B-Series',1994,149),
    (45,'T100',1995,251),
    (46,'Miata MX-5',2011,907),
    (47,'MX-6',1989,485),
    (48,'GTI',1991,778),
    (49,'Coupe Quattro',1990,165),
    (50,'Excursion',2003,621);
